ChanghowLi/micropython/ports/renesas-ra8/boards/CPKCOR_RA8P1/mpconfigboard.h
/**
 * @file    mpconfigport.h
 * @brief   MicroPython port renesas-ra8 配置文件
 * @note    不要定义 MICROPY_MIN_USE_CORTEX_CPU
 */

#define MICROPY_HW_BOARD_NAME       "CPKCOR-RA8P1"
#define MICROPY_HW_MCU_NAME         "RA8P1"
#define MICROPY_HW_SPI0_MISO        BSP_IO_PORT_07_PIN_00
#define MICROPY_HW_SPI0_MOSI        BSP_IO_PORT_07_PIN_01
#define MICROPY_HW_SPI0_SCK         BSP_IO_PORT_07_PIN_02
#define MICROPY_HW_SPI1_MISO        BSP_IO_PORT_01_PIN_00
#define MICROPY_HW_SPI1_MOSI        BSP_IO_PORT_01_PIN_01
#define MICROPY_HW_SPI1_SCK         BSP_IO_PORT_01_PIN_02
#define MICROPY_LONGINT_IMPL        (MICROPY_LONGINT_IMPL_MPZ)
#define MICROPY_FLOAT_IMPL          (MICROPY_FLOAT_IMPL_DOUBLE)

#ifndef MICROPY_HW_ENABLE_RNG
#define MICROPY_HW_ENABLE_RNG		1
#endif

#ifndef MICROPY_HW_ENABLE_RTC
#define MICROPY_HW_ENABLE_RTC       1
#endif

#define MICROPY_PY_THREAD           0
